{
  "model_type": "veridian",
  "architectures": [
    "VeridianForCausalLM"
  ],
  "name_or_path": "MagistrTheOne/veridian-beta",
  "vocab_size": 128000,
  "hidden_size": 5120,
  "intermediate_size": 12288,
  "num_hidden_layers": 34,
  "num_attention_heads": 40,
  "num_key_value_heads": 8,
  "num_local_experts": 8,
  "num_shared_experts": 1,
  "num_experts_per_tok": 2,
  "max_position_embeddings": 8192,
  "target_max_position_embeddings": 131072,
  "pad_token_id": 0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "attention_dropout": 0.0,
  "residual_dropout": 0.0,
  "rms_norm_eps": 1e-06,
  "rope_theta": 500000.0,
  "rope_scaling": {
    "rope_type": "yarn",
    "factor": 16.0,
    "original_max_position_embeddings": 8192,
    "beta_fast": 32.0,
    "beta_slow": 1.0
  },
  "router_aux_loss_coef": 0.01,
  "router_z_loss_coef": 0.0001,
  "capacity_factor_train": 1.25,
  "capacity_factor_eval": 1.0,
  "initializer_range": 0.02,
  "tie_word_embeddings": true,
  "use_bias": false,
  "use_cache": true,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.57.1"
}
